import React from "react";

function PrivacyPolicy() {
  return (
    <div className="max-w-[1280px] mx-auto privacy-policy my-[80px] px-4 sm:px-8 lg:px-0">
      <h2 className="text-[35px] leading-[53px] font-bold">
        นโยบายการความเป็นส่วนตัว
      </h2>
      <p>ปรับปรุงเมื่อ 31 พฤษภาคม 2565</p>
      <p>
        <span>
          บริษัท วรรณาวีย์ จำกัด ตั้งค่าและใช้นโยบายความเป็นส่วนตัว
          หรือตั้งค่าและใช้คุกกี้ รวมถึงเทคโนโลยีที่คล้ายคลึงกันเพื่อจัดเก็บ
          ดูแลข้อมูลการใช้งานของผู้ใช้งาน ส่งโฆษณา ให้บริการบทความ
          วิเคราะห์และจัดเก็บการใช้งานบนบริการ ยกตัวอย่างเช่น
          การใช้คุกกี้และเทคโนโลยีติดตามอื่นๆ
          เป็นพื้นฐานสำหรับการจัดเก็บข้อมูลออนไลน์ของผู้ใช้งานผ่านเว็บไซต์และแอพพลิเคชัน
          หรือบริการอื่นๆ
          สำหรับข้อมูลเพิ่มเติมว่าเราใช้คุกกี้และเทคโนโลยีที่เหมือนกัน
          รวมถึงเราควบคุมเครื่องมือต่างๆ อย่างไรจะถูกระบุไว้อยู่ด้านล่างนี้
        </span>
      </p>
      <p>
        <span>
          กรณีที่ท่านต้องการข้อมูลเพิ่มเติมเกี่ยวกับการใช้คุกกี้ของเรา
          หรือแจ้งการใช้ยกเลิกคุกกี้
          ท่านสามารถติดต่อมายังเจ้าหน้าที่เพื่อประสานงานฝ่ายควบคุมข้อมูลส่วนบุคคลได้ทางอีเมล{" "}
        </span>
        <span>
          <br />
        </span>
        regallypink@gmail.com
      </p>
      <h4 className="text-xl font-bold">สารบัญ :</h4>
      <ul className="list-disc pl-4">
        <li className="font-normal" aria-level="1">
          <a href="#cookie" className="font-normal">
            คุกกี้คืออะไร
          </a>
        </li>
        <li className="font-normal" aria-level="1">
          <a href="#cookie2" className="font-normal">
            เราใช้คุกกี้อย่างไร
          </a>
        </li>
        <li className="font-normal" aria-level="1">
          <a href="#cookie3" className="font-normal">
            ชนิดของคุกกี้
          </a>
        </li>
        <li className="font-normal" aria-level="1">
          <a href="#cookie4" className="font-normal">
            ประเภทของคุกกี้ที่ใช้
          </a>
        </li>
        <li className="font-normal" aria-level="1">
          <a href="#cookie5" className="font-normal">
            การจัดการคุกกี้
          </a>
        </li>
        <li className="font-normal" aria-level="1">
          <a href="#cookie6" className="font-normal">
            การเชื่อมต่อผ่านสื่อสังคมออนไลน์
          </a>
        </li>
      </ul>
      <h3 id="cookie" className="text-2xl font-bold">
        คุกกี้คืออะไร
      </h3>
      <p className="font-normal">
        <span className="font-normal">
          คุกกี้คือไฟล์ข้อมูลเล็กๆ วางอยู่บนคอมพิวเตอร์และอุปกรณ์อื่นๆ
          ที่ใช้ระบุตัวตนและจดจำผู้ใช้งาน หรืออุปกรณ์เพื่อจะจัดเก็บข้อมูล
          เราอาจทำการเก็บรวบรวมข้อมูลจากท่านโดยอัตโนมัติผ่านคุกกี้หรือเทคโนโลยีอื่นที่คล้ายคลึงกันเมื่อท่านเยี่ยมชมเว็บไซต์ของเรา
          โดยคุกกี้จะถูกแบ่งประเภทไปตามหน้าที่การใช้งานและวัตถุประสงค์การใช้งาน
          ได้แก่ คุกกี้ที่จำเป็นสำหรับการใช้งาน คุกกี้ปฏิบัติงาน
          คุกกี้เพื่อปรับปรุงประสิทธิผล และคุกกี้สำหรับการตลาด
        </span>
      </p>
      <h3 id="cookie2" className="text-2xl font-bold">
        เราใช้คุกกี้อย่างไร
      </h3>
      <p className="font-normal">
        เราและหุ้นส่วนบุคคลภายนอกของเราอาจเก็บรวบรวมข้อมูลผ่านคุกกี้สำหรับข้อมูลการเข้าใช้บริการ
        เพื่อพัฒนาประสบการณ์การใช้งานของท่านให้ดียิ่งขึ้นและเพื่อวัตถุประสงค์อื่นๆ
        รวมถึง
      </p>
      <ol className="list-decimal ml-6">
        <li className="font-normal">
          จดจำผู้ใช้งาน ยกตัวอย่างเช่น
          คุกกี้จะช่วยให้เราระบุตัวตนได้ว่าท่านคือผู้ใช้งานที่ลงทะเบียนไว้บนบริการของเรา
          หรือเก็บการตั้งค่า หรือข้อมูลที่ท่านเคยให้เราไว้
        </li>
        <li className="font-normal">
          วิเคราะห์การใช้งานของท่านบนบริการของเรา
          เราสามารถใช้คุกกี้เพื่อจะเข้าใจว่าผู้ใช้บริการใช้งานอะไรบ้างบนบริการของเรา
          หรือหน้าไหน ส่วนไหนของบริการที่เป็นที่นิยมที่สุด
        </li>
        <li className="font-normal">
          นำเสนอโฆษณา
          โดยใช้คุกกี้ช่วยให้เรานำเสนอโฆษณาที่เราเชื่อว่าท่านจะสนใจโดยมาจากข้อมูลของท่าน
          (ตามที่ระบุไว้ในหัวข้อเราใช้ข้อมูลของท่านอย่างไร
          และหัวข้อเกี่ยวกับโฆษณาในนโยบายความเป็นส่วนตัว)
        </li>
        <li className="font-normal">
          ข้อมูลบัตรเครดิตและข้อมูลทางการเงินอื่นๆ
          ซึ่งจำเป็นในการดำเนินการด้านธุรกรรมทางการเงินเมื่อท่านใช้บริการของเรา
          ซึ่งข้อมูลดังกล่าวอาจถูกเก็บรวบรวมและรักษาไว้โดยผู้ประมวลผลบุคคลภายนอก
          หรือผู้ประมวลผลด้านธุรกรรมทางการเงินของเราเอง
          ผู้ประมวลผลด้านธุรกรรมทางการเงินเหล่านั้น
          อาจจัดให้มีคุกกี้ซึ่งทำให้ท่านสามารถทำการจ่ายเงินในครั้งต่อๆ
          ไปโดยใช้ข้อมูลทางการเงินที่ท่านได้ให้ไว้เรียบร้อยแล้ว
        </li>
      </ol>
      <p className="font-normal">
        โปรดสังเกตว่าเราใช้คุกกี้เพื่อวัตถุประสงค์ดังกล่าวข้างต้น
        แต่อาจจะมีการจัดเก็บรวบรวมข้อมูลที่ไม่ใช่ข้อมูลส่วนบุคคลมาด้วยผ่านเทคโนโลยีเหล่านี้
        เพื่อให้ผู้โฆษณาและหุ้นส่วนอื่นๆ ของเราวิเคราะห์ได้ว่าท่านและบุคคลอื่นๆ
        ใช้บริการเราอย่างไรเพื่อนำเสนอโฆษณาที่เหมาะสม
      </p>
      <p className="font-normal">
        เราอาจอนุญาตให้ผู้โฆษณาและหุ้นส่วนบุคคลภายนอกอื่นๆ มาวางคุกกี้ เว็บบีคอน
        และเทคโนโลยีที่คล้ายคลึงกัน
        ไว้บนบางบริการของเราเพื่อวิเคราะห์ว่าบริการเหล่านี้ถูกใช้อย่างไรและนำไปเสนอโฆษณา
        โปรดสังเกตว่าการใช้คุกกี้ของบุคคลภายนอกอยู่ภายใต้นโยบายความเป็นส่วนตัวของพวกเขาเอง
        เราไม่อาจรับผิดชอบในการใช้คุกกี้ของบุคคลภายนอก
      </p>
      <p className="font-normal">
        คุกกี้ที่ทางเราใช้เรียกว่า คุกกี้ที่ใช้โดยหุ้นส่วนหรือบุคคลภายนอกคือ
        third-party cookies
        โดยเว็บไซต์ของเราจะไม่สามารถเข้าถึงข้อมูลที่จัดเก็บโดย third-party
        cookies ได้ และบริษัทอื่นๆ
        จะไม่สามารถเข้าถึงข้อมูลที่จัดเก็บผ่านคุกกี้ของเราเช่นกัน
      </p>
      <h3 className="font-semibold mt-4">
        <b>ชนิดของคุกกี้</b>
      </h3>
      <p className="font-normal text-base mb-4">
        เราขออธิบายเพิ่มเติมในตารางด้านล่างว่าเราใช้คุกกี้แต่ละประเภทอย่างไรบนบริการของเรา
        โดยทั้งหมดหรือบางส่วนของคุกกี้อาจอยู่บนบราวเซอร์ของท่าน
        บราวเซอร์ของท่านอาจสามารถปิดหรือจัดการคุกกี้ได้ อย่างไรก็ตาม
        โปรดทราบว่าถ้าท่านทำเช่นนั้น
        เราอาจจะไม่สามารถปรับเปลี่ยนการใช้งานตามความชอบของท่านได้
        และบริการบางส่วนของเราอาจไม่สามารถทำงานได้อย่างที่สมควร
      </p>

      <h3 id="cookie4" className="text-lg font-semibold mb-2">
        ประเภทของคุกกี้ที่ใช้
      </h3>

      <p className="font-normal text-base mb-4">
        การระบุตัวตน : คุกนี้จะแจ้งให้เราทราบเมื่อท่านเข้ามาใช้บริการของเรา
        เพื่อที่เราจะสามารถให้บริการที่เหมาะสมและปลอดภัย
        เพื่อประสบการณ์ที่ดีของท่านได้ ยกตัวอย่างเช่น
        คุกกี้นี้จะแจ้งให้เราทราบเมื่อท่านลงชื่อเข้าใช้สมาชิก
        เพื่อจะช่วยให้เรารับรู้ได้ว่าท่านได้เข้าใช้งานระบบสมาชิกและแสดงข้อมูลที่เหมาะกับท่าน
      </p>

      <p className="font-normal">
        การตั้งค่า : เราใช้คุกกี้ในการบันทึกรูปแบบ การตั้งค่าต่างๆ ของท่าน
        เพื่อที่จะมั่นใจว่าบริการของเราเหมาะสมกับท่าน
        คุกกี้เหล่านี้ช่วยให้เว็บไซต์ของเราในการจดจำข้อมูลซึ่งจะเปลี่ยนแปลงการแสดงผล
        เช่น ภาษาที่ท่านตั้งค่า หรือภูมิภาคที่ท่านอยู่ ยกตัวอย่างเช่น
      </p>
      <ul className="list-disc list-inside font-normal pl-4">
        <li>เราใช้คุกกี้ภายในบริการเพื่อบันทึกว่าท่านอ่านบทความใดบ้างและ</li>
        <li>เตือนว่าเราส่งอะไรถึงท่านบ้างเพื่อป้องกันการส่งซ้ำซ้อน และ</li>
        <li>
          บันทึกการตั้งค่าของท่าน (เช่น ขนาดตัวอักษร) เพื่อที่ว่าบริการอื่นๆ
          ที่เกี่ยวข้องของเราจะปรับการตั้งค่าดังกล่าวโดยอัตโนมัติเมื่อท่านเข้าใช้งานอีกครั้ง
        </li>
      </ul>
      <p className="font-normal">
        หากท่านดำเนินการลบข้อมูลดังกล่าวซึ่งเก็บโดยคุกกี้
        การตั้งค่าอาจส่งผลให้ประสบการณ์การใช้งานบนเว็บไซต์ของเราไม่ได้ประสิทธิภาพเท่าที่ควร
        แต่จะไม่เป็นอุปสรรคต่อการใช้บริการของเรา
      </p>
      <p className="font-normal">
        ความปลอดภัย : เราใช้คุกกี้เพื่อยกระดับการรักษาความปลอดภัยข้อมูลของท่าน
        และเพื่อป้องกันการฉ้อฉล อาชญากรรม หรือกิจกรรมอื่นๆ ที่น่าสงสัย
        ยกตัวอย่างเช่น
        คุกกี้นี้สามารถระบุได้ว่าท่านลงชื่อเข้าใช้สมาชิกบนบริการของเราในพื้นที่ประจำหรือไม่
        และเพื่อป้องกันการแอบอ้างตัวตนและข้อมูลที่ไม่เหมาะสมอื่น ๆ
      </p>
      <p className="font-normal">
        ระบบ : เราใช้คุกกี้นี้เพื่อแสดง และปรับปรุงบริการของเรา ยกตัวอย่างเช่น
        คุกกี้นี้ช่วยเหลือเราในการกรอกข้อมูลบัญชีของท่านล่วงหน้า
        ขณะจะทำการลงชื่อเข้าใช้งานบนบริการของเรา
        ช่วยให้ท่านใช้บริการของเราได้อย่างมีประสิทธิภาพมากขึ้น
      </p>
      <p className="font-normal">
        ประสิทธิผล : เราใช้คุกกี้นี้เพื่อปรับปรุงความเร็ว สมรรถนะ
        และประสิทธิผลของบริการของเรา ยกตัวอย่างเช่น
        คุกกี้นี้สามารถช่วยเรื่องการไหลเวียนของเราเตอร์ระหว่างเซิร์ฟเวอร์
        และประเมินความเร็วในการโหลดข้อมูลของบริการเราเมื่อมีผู้ใช้งานจำนวนมาก
        เราอาจใช้คุกกี้นี้ในการบันทึกข้อมูลชั่วคราวบนบราวเซอร์ของท่านเพื่อที่จะสามารถโหลดข้อมูลและตอบสนองความเร็วได้มากขึ้นเมื่อท่านเข้ามาใช้บริการของเรา
      </p>
      <p className="font-normal">
        วิเคราะห์และวิจัย : เราใช้คุกกี้นี้เพื่อติดตามและปรับปรุงบริการของเรา
        และเพื่อช่วยเราหาข้อมูลอ้างอิงสำหรับการวิจัยและพัฒนาบริการหรือระบบใหม่ๆ
        ของเรา ยกตัวอย่างเช่น
        คุกกี้ช่วยเราเข้าใจได้ดีขึ้นว่าท่านใช้บริการของเราอย่างไร
        และช่วยให้เราปรับปรุงประสบการณ์ใช้งานของท่านหรือผู้ใช้อื่นบนบริการของเรา
        ข้อมูลดังกล่าวอาจรวมถึงเวลาที่ท่านใช้งานบริการเราในแต่ละครั้ง
        ตลอดจนหน้าและระบบไหนบ้างที่ท่านเข้ามาใช้บริการของเรา
      </p>
      <p className="font-normal">
        การโฆษณา :
        เราใช้คุกกี้นี้เพื่อปรับปรุงโฆษณาของเราเพื่อนำเสนอให้เหมาะสมตามความชอบของท่าน
        ยกตัวอย่างเช่น
        คุกกี้นี้ช่วยเราแสดงโฆษณาที่เกี่ยวข้องกับท่านมากขึ้นและติดตามว่าโฆษณาใดบ้างที่ท่านเปิดอ่านหรือดูบนบริการของเราและเข้าไปดูโฆษณานั้นๆ
        ของผู้โฆษณา ในกรณีเดียวกัน
        หุ้นส่วนของเราอาจใช้คุกกี้นี้เพื่อให้แน่ใจว่าเราแสดงโฆษณาอย่างมีประสิทธิผล
        หรือให้ข้อมูลเราถึงการติดต่อระหว่างท่านกับผู้ลงโฆษณา
      </p>
      <h3 className="text-lg font-bold" id="cookie5">
        การจัดการคุกกี้
      </h3>
      <p className="font-normal">
        ท่านสามารถบริหารจัดการคุกกี้บนเว็บไซต์ผ่านการตั้งค่าบนบราวเซอร์ได้
        และท่านมีทางเลือกที่จะเปลี่ยนแปลงการตั้งค่าโดยยอมรับ ปฏิเสธ หรือลบคุกกี้
        ถ้าท่านเลือกจะเปลี่ยนแปลงการตั้งค่า
        ท่านอาจจะพบว่าระบบหรือบริการของเราอาจไม่สามารถบริการได้เต็มประสิทธิภาพ
        การตั้งค่าบนบนบราวเซอร์แต่ละประเภทค่อนข้างจะแตกต่างกัน
        ดังนั้นเพื่อจะบริหารจัดการคุกกี้
        ท่านควรเข้าไปตรวจสอบการตั้งค่าบนบราวเซอร์ของท่าน
      </p>
      <p className="font-normal">
        เรายังมีการใช้เทคโนโลยีติดตามอื่นๆ นอกเหนือจากคุกกี้ดังนี้
      </p>
      <ul className="list-disc ml-6">
        <li className="font-normal">
          การแชร์ข้อมูลท้องถิ่น หรือ แฟลชคุกกี้
          ถูกออกแบบมาเพื่อสนับสนุนข้อมูลบทความบนบราวเซอร์ โดยอโดบีแฟลช
          คุกกี้เหล่านี้ถูกใช้ในการลงโฆษณาและบทความ วิดีโอ บนเว็บไซต์
          เหมือนคุกกี้ประเภทอื่นๆ ที่จะเก็บข้อมูลบนอุปกรณ์ของท่าน
          บางอันจะถูกใช้เพื่อให้สามารถใช้งานโปรแกรมแฟลช
          โดยแฟลชคุกกี้จะถูกลบได้จากภายในอโดบีแฟลชเท่านั้นไม่ใช่บนบราวเซอร์
          กรุณาเข้าไปดูวิธีการจัดการตั้งค่าความเป็นส่วนตัวของท่านและลบแฟลชคุกกี้ได้ที่{" "}
          <a href="http://www.macromedia.com/support/documentation/en/flashplayer/help/settings_manager.html" className="break-words">
            http://www.macromedia.com/support/documentation/en/flashplayer/help/settings_manager.html
          </a>
        </li>
        <li className="font-normal">
          เว็บเซิร์ฟเวอร์ และข้อมูลการใช้งานแอพพลิเคชัน
          บริการของเราจะจัดเก็บข้อมูลอัตโนมัติเพื่อช่วยเราตรวจสอบและป้องกันบริการของเรา
          วิเคราะห์การใช้งาน และปรับปรุงประสบการณ์ใช้งานของผู้ใช้งาน
          ข้อมูลที่ถูกจัดเก็บจะมีดังนี้
          <ul className="list-disc ml-6">
            <li className="font-normal">ไอพีแอดเดรส และชนิดของบราวเซอร์</li>
            <li className="font-normal">
              ข้อมูลอุปกรณ์ รวมถึงที่ระบุตัวตนของอุปกรณ์ (UDID) ที่อยู่ MAC
              ที่ระบุตัวตนสำหรับ ผู้โฆษณา (IFA)
              และที่ระบุตัวตนอื่นๆที่คล้ายคลึงกัน หรือตามแต่ที่ได้รับมอบหมาย
            </li>
            <li className="font-normal">
              ระบบปฏิบัติการของอุปกรณ์และข้อเท็จจริงทางเทคนิคอื่นๆ
            </li>
            <li className="font-normal">
              เมือง รัฐ และประเทศที่ท่านเข้าถึงเว็บไซต์ของเรา
            </li>
            <li className="font-normal">
              หน้าที่เข้าเยี่ยมชม บทความที่เปิดดู บันทึก
            </li>
            <li className="font-normal">ข้อมูลหรือข้อความที่กรอก หรือบันทึก</li>
            <li className="font-normal">ลิงค์ หรือปุ่มที่กดเข้าไปดู</li>
            <li className="font-normal">
              URLs ที่เข้าเยี่ยมชมก่อนหน้าและหลังจากใช้บริการของเรา
            </li>
          </ul>
        </li>
      </ul>
      <p className="font-normal">
        นอกจากนี้ ท่านสามารถจัดการคุกกี้ต่างๆ รวมถึงคุกกี้การโฆษณา
        และยกเลิกการแบ่งปันข้อมูลกับหุ้นส่วนของเราสำหรับวัตถุประสงค์ในการโฆษณาโดยดำเนินการตามขั้นตอนที่ระบุไว้ในนโยบายฉบับนี้
        โดยท่านสามารถหาข้อมูลเกี่ยวกับการยกเลิกดังกล่าวบนหน้าเว็บไซต์ของหุ้นส่วนของเรา
        หรือท่านสามารถจัดการคุกกี้ต่างๆ รวมถึงคุกกี้ที่ใช้ในการโฆษณา
        และยกเลิกการแบ่งปันข้อมูลของท่านโดยคลิกเข้าไปยังลิงค์การตั้งค่าความเป็นส่วนตัวของเราหรือของหุ้นส่วนของเราด้านล่างนี้
      </p>
      <p className="font-normal">3rd Party Cookies</p>
      <h4 className="font-bold">ชื่อผู้ให้บริการ : Google Analytics</h4>
      <p className="font-normal">ชื่อคุกกี้ : _ga, _gaexp, _gat, _gid</p>
      <p className="font-normal">
        วัตถุประสงค์ : เพื่อช่วยตัดสินใจการดำเนินแผนงานทางธุรกิจ
        และการปรับปรุงการให้บริการ
      </p>
      <ul className="list-disc ml-6">
        <li className="font-normal">
          ข้อมูลแหล่งที่มาของผู้ใช้งาน เช่น ผู้ใช้เข้าสู่เว็บไซต์ www.tnt.co.th
          จาก Google Search หรือ Social Network
        </li>
        <li className="font-normal">
          ข้อมูลโฆษณา เช่น ผู้ใช้ที่กำหนดเป้าหมายโดยแคมเปญ AdWords
        </li>
        <li className="font-normal">
          ข้อมูลพฤติกรรม เช่น ระยะเวลา, เวลา, หน้า landing page
          และการติดตามกิจกรรมอื่นๆ
        </li>
        <li className="font-normal">
          ข้อมูลเนื้อหา เช่น ผู้ใช้อ่านบทความเกี่ยวกับการเดินทางในภูเก็ต
        </li>
        <li className="font-normal">
          ปฏิสัมพันธ์ทางสังคม เช่น ผู้ใช้แบ่งปันบทความบนเครือข่ายโซเชียล
        </li>
        <li className="font-normal">
          ข้อมูลส่วนบุคคลของผู้ใช้ Google Analytics สามารถดูในระดับภาพรวม
          แต่ไม่สามารถเจาะจงเป็นรายบุคคลได้ เช่น. เพศ, อายุ, สถานที่ตั้ง
        </li>
        <li className="font-normal">
          การทดสอบ A/B test สำหรับการปรับปรุงเว็บไซต์
        </li>
        <li className="font-normal">
          <a href="https://mantraplantbased.com/privacy-policy">
            นโยบายความเป็นส่วนตัว
          </a>{" "}
          <a href="https://tools.google.com/dlpage/gaoptout/">ยกเลิกบริการ</a>
        </li>
      </ul>
      <h3 className="text-lg font-bold" id="cookie6">
        การเชื่อมต่อผ่านสื่อสังคมออนไลน์
      </h3>
      <p className="font-normal">
        บางบริการของเราอาจรวมถึงสื่อสังคมออนไลน์ต่างๆ เช่น ปุ่มกดถูกใจบนเฟซบุ๊ก
        และปุ่มแชร์ หรือปุ่มตอบสนองต่างๆ
        นอกจากนี้ท่านอาจจะเลือกใช้สื่อสังคมออนไลน์ของท่านในการลงชื่อเข้าใช้งาน
        ยกตัวอย่างเช่น เฟซบุ๊กหรือลิงค์อินเพื่อเข้ามายังบริการของเรา
        ถ้าท่านเลือกที่จะเชื่อมต่อโดยใช้สื่อสังคมออนไลน์หรือบริการอื่นที่คล้ายคลึงกัน
        เราอาจจะได้รับข้อมูลที่ระบุตัวตนของท่านจากบริการนั้นเพื่ออนุญาตให้ท่านลงชื่อเข้าใช้งาน
        รวมถึงข้อมูลอื่นๆ
        ที่ท่านเลือกจะแบ่งปันเมื่อท่านเชื่อมต่อด้วยบริการเหล่านี้
      </p>
      <p className="font-normal">
        บริการเหล่านี้อาจจัดเก็บข้อมูลของท่าน เช่นเว็บไซต์ที่ท่านเคยเข้าเยี่ยมชม
        ไอพีแอดเดรส
        และอาจจะมีการตั้งค่าคุกกี้เพื่อที่จะให้ระบบสามารถทำงานได้อย่างเหมาะสม
        เราจะไม่รับผิดชอบถึงความปลอดภัยหรือข้อมูลความเป็นส่วนตัวใดๆ
        ที่ถูกจัดเก็บโดยบริการของบุคคลภายนอกเหล่านี้
        ท่านควรศึกษานโยบายความเป็นส่วนตัวหรือข้อบังคับที่เกี่ยวข้องของบริการของบุคคลภายนอกที่ท่านเชื่อมต่อ
        ใช้ หรือเข้าถึง
        ในกรณีที่ท่านไม่ต้องการให้ข้อมูลส่วนบุคคลของท่านถูกแบ่งปันผ่านบัญชีสื่อสังคมออนไลน์
        หรือผู้ให้บริการสื่อสังคมออนไลน์รายอื่น
        โปรดอย่าเชื่อมต่อบัญชีสื่อสังคมออนไลน์ของท่านกับบัญชีของท่านบนบริการเรา
        และโปรดอย่าใช้ระบบแชร์ข้อมูลบนบริการของเรา
      </p>
    </div>
  );
}

export default PrivacyPolicy;
